/*
 * Регулярные выражения
 */

// Задание 1
// Найдем HTML-цвета в строке
var stringWithColors = 'Цвета бывают в таком формате: #088, #91a, а бывают в таком формате - #123456, #00FF22.';
stringWithColors.match( /#[0-f][0-f][0-f][0-f][0-f][0-f]|#[0-f][0-f][0-f]/ig );

// Задание 2
// Найдем все положительные числа, в том числе и с десятичной точкой
// Не более 4 знаков до точки и не более 2 знаков после точки
var stringWithNumbers = '1.5 3; 8888.91 0.12. 123.4.';
stringWithNumbers.match( /\d\d\d\d.\d\d|\d\d\d\d.\d|\d\d\d\d|\d\d\d.\d\d|\d\d\d.\d|\d\d\d|\d\d.\d\d|\d\d.\d|\d\d|\d.\d\d|\d.\d|\d/ig );

// Задание 3
// Найдем время в строке
var stringWithTime = 'Часы и минуты состоят из двух цифр, например 09:00, 21-30. Но 99:82 - не время.';
stringWithTime.match( /[0-2][0-9]:[0-5][0-9]|[0-2][0-9]-[0-5][0-9]/ig );

// Задание 4
// Найдем шахматную координату
var stringWithCoordinate = 'Белые начинают. Пешка E2-E4. Ход чёрных. Конь g8-f6.';
stringWithCoordinate.match( /[a-h][0-8]/ig );

// Задание 5 - не успела целиком
// Найдем номер телефона в формате +7(965)-123-45-67, email, серию и номер паспорта
var user = 'Телефон: +7(965)-123-45-67 email: ivanov@gmail.com Паспорт 4412 123456';
//var phone = user.match( /+7(\d\d\d)-\d\d\d-\d\d-\d\d/ig );
if ( user.search( /@/i ) != -1 && user.search( /./i ) != -1 ) {
	console.log('Email корректен');
}